app/views/programs/_form.html.erb

SELECT "divisions".* FROM "divisions" ORDER BY id DESC
---
        <%= f.label "Division" %>
        <%= f.select :division_id, Division.order('id DESC').collect {|n| [n.name,n.id]} %>

SELECT "funnel_stages".* FROM "funnel_stages"
---
        <%= f.label "Funnel Stage" %>
        <%= f.select :funnel_stage_id, FunnelStage.all.collect{|f| [f.name,f.id]}, options={:prompt => "-Select a Funnel Stage"} %>

SELECT "opportunity_types".* FROM "opportunity_types"
---
        <%= f.label "Opportunity Type" %>
        <%= f.select :opportunity_type_id, OpportunityType.all.collect{|o| [o.name,o.id]}, options={:prompt => "-Select an Opportunity Type"} %>