app/views/divisions/_form.html.erb

SELECT "clients".* FROM "clients" ORDER BY id DESC
---
    <%= f.label "Client" %><br />
    <%= f.select :client_id, Client.order('id DESC').collect {|n| [n.name,n.id]} %>

SELECT "practice_groups".* FROM "practice_groups" ORDER BY name
---
    <%= f.label 'Practice Group' %><br />
    <%= f.select :practice_group_id, PracticeGroup.order('name').collect {|p| [p.name,p.id]}, options={:prompt => "-Select a Practice Group"} %>