app/controllers/clients_controller.rb

INSERT INTO "clients" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 17 Jan 2012 18:51:18 UTC +00:00], ["name", "Client1"], ["updated_at", Tue, 17 Jan 2012 18:51:18 UTC +00:00]]
---
  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save