app/controllers/fiscal_projections_controller.rb

  def index
    @funnel_stages = FunnelStage.all

    @all_programs = Program.order("name")

    @programs = Program.includes(:division => :client)

    @programs = @programs.where(:id => params[:program_id]) if params[:program_id].present?

    @programs = @programs.page(params[:page]).per(25)

    @fiscal_projections = FiscalProjection.find_current(@programs)
---
SELECT "funnel_stages".* FROM "funnel_stages"
SELECT "programs".* FROM "programs" ORDER BY name
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (2, 3, 4)
SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" IN (1, 2, 3)
SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = 48 LIMIT 1
SELECT "programs".* FROM "programs" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "programs"
SELECT "fiscal_projections".* FROM "fiscal_projections" WHERE "fiscal_projections"."program_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25) AND ((fiscal_projections.month >= 1 AND fiscal_projections.year = 2012) OR (fiscal_projections.month < 1 AND fiscal_projections.year = 2013))

  def create
    @fiscal_projection = FiscalProjection.new(params[:fiscal_projection])

    respond_to do |format|
      if @fiscal_projection.save
---
INSERT INTO "fiscal_projections" ("amount", "comment", "created_at", "month", "program_id", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?)  [["amount", 55], ["comment", nil], ["created_at", Tue, 17 Jan 2012 19:01:22 UTC +00:00], ["month", 1], ["program_id", 1], ["updated_at", Tue, 17 Jan 2012 19:01:22 UTC +00:00], ["year", 2012]]

  def update
    @fiscal_projection = FiscalProjection.find(params[:id])

    respond_to do |format|
      if @fiscal_projection.update_attributes(params[:fiscal_projection])
---
SELECT "fiscal_projections".* FROM "fiscal_projections" WHERE "fiscal_projections"."id" = ? LIMIT 1  [["id", "592"]]
UPDATE "fiscal_projections" SET "amount" = 9994, "updated_at" = '2012-01-17 19:40:25.352829' WHERE "fiscal_projections"."id" = 592

  def destroy
    @fiscal_projection = FiscalProjection.find(params[:id])
    @fiscal_projection.destroy
---
SELECT "fiscal_projections".* FROM "fiscal_projections" WHERE "fiscal_projections"."id" = ? LIMIT 1  [["id", "586"]]
DELETE FROM "fiscal_projections" WHERE "fiscal_projections"."id" = ?  [["id", 586]]