app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "programs" SET "funnel_stage_id" = 7, "updated_at" = '2012-01-17 19:01:07.872157' WHERE "programs"."id" = 1
---
  def update
    @program = Program.find(params[:id])

     if params[:funnel_stage_id].present?
       @program.update_attributes("funnel_stage_id" =>params[:funnel_stage_id])